In [1]:
import pandas as pd
furniture = pd.read_csv('furniture.csv')
furniture.rename(columns={'Product':'Category'}, inplace=True)
furniture['Gross'] = furniture.eval('Cost * 1.1')
furniture

   Serial      Category      Brand   Cost    Gross
0       1          Sofa      Sam’s  35000  38500.0
1       2           Bed   Darien’s  50000  55000.0
2       3    Nightstand  Stephen’s  11000  12100.0
3       4  Coffee table      Sam’s  19000  20900.0
4       5      Wall art      Doy’s   7777   8554.7

In [6]:
furniture.isnull() # Basically, isnull() will tell her if a column misses a value or more.

   Serial  Category  Brand   Cost  Gross
0   False     False  False  False  False
1   False     False  False  False  False
2   False     False  False  False  False
3   False     False  False  False  False
4   False     False  False  False  False

In [9]:
furniture.notnull() #Similarly, notnull() returns False for an NaN.

   Serial  Category  Brand  Cost  Gross
0    True      True   True  True   True
1    True      True   True  True   True
2    True      True   True  True   True
3    True      True   True  True   True
4    True      True   True  True   True

In [10]:
furniture.isnull().sum() #Number of missing values

Serial      0
Category    0
Brand       0
Cost        0
Gross       0
dtype: int64

In [ ]:
# To drop a missing value, you can use dropna(), and to fill it, use fillna().